#include <iostream>
#include <stdlib.h>
#include <stdio.h>
using namespace std;
int main() {
    setlocale(LC_ALL, "Russian");
    cout << "Ќачинаем с i = 1 => j = 1, по циклу for проходим 1 раз => 1 сравнение, 0 перестановок.";
    cout << endl << "ƒалее i = 2 => j = 2, по циклу for проходим 2 раз => 3 сравнение, 0 перестановок.";
    cout << endl << "ƒалее i = 3 => j = 3, по циклу for проходим 3 раз => 6 сравнение, 0 перестановок.";
    cout << endl << "ƒалее i = 4 => j = 4, по циклу for проходим 4 раз => 10 сравнение, 0 перестановок.";
    cout << endl << "Ќоль престановок, так как массив отсортирован, на каждом i мы рассматриваем элементы от i до 0, т.е.";
    cout << endl << "при i = 1 - сравним 1 раз, при i = 2 - сравним 2 раза и так далее. Ќадеюсь, у мен€ получилось расписать" << endl;
    system("pause");
    int n, t, k = 0, c = 0;
    cout << "¬ведите длину массива: ";
    cin >> n;
    int *a;
    a = (int*) malloc(n * sizeof(int));
    cout << "¬ведите элементы массива: ";
    for (int i = 0; i < n; i++)
        cin >> a[i];
    for (int i = 1; i < n; i++)
    {
        for (int j = i; j > 0; j--)
        {
            if (a[j - 1] > a[j])
            {
                c++;
                t = a[j - 1];
                a[j - 1] = a[j];
                a[j] = t;
            }
            k++;
        }
    }
    cout << " ол-во перестановок - " << c << endl << " ол-во сравнений - " << k << endl;
}
